Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default/default.tfplan"' in '/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default': exit status 1
module.authentik_system.random_password.postgresql_password: Refreshing state... [id=none]
module.authentik_system.random_password.akadmin_password: Refreshing state... [id=none]
module.authentik_system.random_password.akadmin_api_key: Refreshing state... [id=none]
module.authentik_system.random_password.authentik_secret_key: Refreshing state... [id=none]
module.omada_controller.kubernetes_namespace_v1.omada_controller: Refreshing state... [id=omada-controller]
module.longhorn_system.kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
kubernetes_secret_v1.bill_token: Refreshing state... [id=default/bill-token]
module.pihole_system.data.kubernetes_service_v1.traefik: Reading...
module.pihole_system.data.kubernetes_service_v1.traefik: Read complete after 0s [id=kube-system/traefik]
module.traefik_config.kubernetes_manifest.traefik_entrypoints: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.longhorn_system.kubernetes_manifest.recurringjob_longhorn_system_daily_backup: Refreshing state...
module.pihole_system.kubernetes_manifest.middleware_admin: Refreshing state...
module.pihole_system.kubernetes_manifest.certificate_piholeassistant_billv_ca: Refreshing state...
module.pihole_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
kubernetes_service_account_v1.bill: Refreshing state... [id=default/bill]
module.pihole_system.kubernetes_manifest.assistant_ingressroute: Refreshing state...
module.atlantis.kubernetes_namespace_v1.namespace: Refreshing state... [id=atlantis-system]
kubernetes_service_account_v1.test: Refreshing state... [id=default/test]
module.dashboard.kubernetes_namespace_v1.kube_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.atlantis.kubernetes_cluster_role_binding_v1.atlantis-admin: Refreshing state... [id=atlantis-cluster-admin]
module.omada_controller.kubernetes_manifest.ingressroute: Refreshing state...
module.cert-manager.kubernetes_manifest.namespace_cert_manager: Refreshing state...
module.pihole_system.kubernetes_manifest.middleware_ipallowlist: Refreshing state...
module.pihole_system.kubernetes_manifest.ingressroute: Refreshing state...
module.authentik_system.kubernetes_manifest.ingressroute: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_auth_billv_ca: Refreshing state...
module.metallb-system.kubernetes_manifest.namespace_metallb_system: Refreshing state...
module.omada_controller.kubernetes_service_v1.omada_controller: Refreshing state... [id=omada-controller/omada-controller]
module.omada_controller.kubernetes_manifest.servers_transport: Refreshing state...
module.longhorn_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.longhorn_system.kubernetes_manifest.ingressroute: Refreshing state...
module.omada_controller.kubernetes_stateful_set_v1.omada: Refreshing state... [id=omada-controller/omada-controller]
module.longhorn_system.aws_iam_user.longhorn: Refreshing state... [id=longhorn]
module.longhorn_system.aws_s3_bucket.longhorn_backups: Refreshing state... [id=longhorn-backups.billv.ca]
module.authentik_system.data.aws_ssm_parameter.smtp: Reading...
module.atlantis.aws_iam_user.atlantis: Refreshing state... [id=atlantis]
module.atlantis.data.aws_ssm_parameter.atlantis-key: Reading...
module.authentik_system.data.aws_ssm_parameter.smtp: Read complete after 0s [id=zoho-smtp-creds]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Reading...
module.pihole_system.helm_release.pihole: Refreshing state... [id=pihole]
module.atlantis.data.aws_ssm_parameter.atlantis-key: Read complete after 1s [id=/runatlantis/key]
kubernetes_cluster_role_binding.admin: Refreshing state... [id=bill]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Read complete after 1s [id=/runatlantis/webhook-secret]
module.atlantis.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.dashboard.helm_release.kube-dashboard: Refreshing state... [id=kubernetes-dashboard]
module.omada_controller.kubernetes_manifest.certificate_authentik_omada_billv_ca: Refreshing state...
module.atlantis.kubernetes_manifest.ingressroute: Refreshing state...
module.dashboard.kubernetes_manifest.ingressroute: Refreshing state...
module.authentik_system.helm_release.authentik: Refreshing state... [id=authentik]
module.atlantis.aws_iam_user_policy.atlantis: Refreshing state... [id=atlantis:atlantis]
module.atlantis.aws_iam_access_key.atlantis: Refreshing state... [id=AKIAVZNMUHPE5HTUUUU2]
module.dashboard.kubernetes_manifest.servers_transport: Refreshing state...
module.dashboard.kubernetes_manifest.certificate_kube_billv_ca: Refreshing state...
module.metallb-system.kubernetes_manifest.rolebinding_metallb_system_pod_lister: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_communities_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrolebinding_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bgppeers_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.serviceaccount_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.validatingwebhookconfiguration_metallb_webhook_configuration: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bfdprofiles_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.daemonset_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.role_metallb_system_pod_lister: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_l2advertisements_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_servicel2statuses_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.role_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.serviceaccount_metallb_system_speaker: Refreshing state...
module.metallb-system.kubernetes_manifest.deployment_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrolebinding_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_ipaddresspools_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrole_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.secret_metallb_system_metallb_webhook_cert: Refreshing state...
module.metallb-system.kubernetes_manifest.configmap_metallb_system_metallb_excludel2: Refreshing state...
module.metallb-system.kubernetes_manifest.customresourcedefinition_bgpadvertisements_metallb_io: Refreshing state...
module.metallb-system.kubernetes_manifest.rolebinding_metallb_system_controller: Refreshing state...
module.metallb-system.kubernetes_manifest.service_metallb_system_metallb_webhook_service: Refreshing state...
module.metallb-system.kubernetes_manifest.clusterrole_metallb_system_speaker: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_view: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_certificates: Refreshing state...
module.cert-manager.kubernetes_manifest.role_kube_system_cert_manager_cainjector_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_cert_manager_cert_manager_webhook_dynamic_serving: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_clusterissuers: Refreshing state...
module.cert-manager.kubernetes_manifest.mutatingwebhookconfiguration_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_certificatesigningrequests: Refreshing state...
module.cert-manager.kubernetes_manifest.validatingwebhookconfiguration_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_approve_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_clusterissuers_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_kube_system_cert_manager_cainjector_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_cluster_view: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_edit: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_webhook_subjectaccessreviews: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_orders_acme_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_issuers: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_ingress_shim: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_certificates_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_certificaterequests_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_clusterissuers: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_approve_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_certificates: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_kube_system_cert_manager_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.role_cert_manager_cert_manager_tokenrequest: Refreshing state...
module.cert-manager.kubernetes_manifest.rolebinding_cert_manager_cert_manager_cert_manager_tokenrequest: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_webhook_subjectaccessreviews: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_orders: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_challenges: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_ingress_shim: Refreshing state...
module.cert-manager.kubernetes_manifest.role_cert_manager_cert_manager_webhook_dynamic_serving: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_orders: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_challenges: Refreshing state...
module.cert-manager.kubernetes_manifest.service_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.serviceaccount_cert_manager_cert_manager_cainjector: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrole_cert_manager_controller_certificatesigningrequests: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager_webhook: Refreshing state...
module.cert-manager.kubernetes_manifest.role_kube_system_cert_manager_leaderelection: Refreshing state...
module.cert-manager.kubernetes_manifest.clusterrolebinding_cert_manager_controller_issuers: Refreshing state...
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager_cainjector: Refreshing state...
module.atlantis.helm_release.atlantis: Refreshing state... [id=runatlantis]
module.authentik_system.data.kubernetes_service_v1.authentik_server: Reading...
module.authentik_system.data.kubernetes_service_v1.authentik_server: Read complete after 0s [id=authentik/authentik-server]
module.cert-manager.kubernetes_manifest.deployment_cert_manager_cert_manager: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_issuers_cert_manager_io: Refreshing state...
module.cert-manager.kubernetes_manifest.customresourcedefinition_challenges_acme_cert_manager_io: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.atlantis.aws_iam_user_policy.atlantis will be updated in-place
  ~ resource "aws_iam_user_policy" "atlantis" {
        id          = "atlantis:atlantis"
        name        = "atlantis"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "ssm:GetParameter",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/webhook-secret",
                            "arn:aws:ssm:us-east-1:398183381961:parameter/zoho-smtp-creds",
                            "arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/key",
                        ]
                        Sid      = "GrantAtlantisSSMAccess"
                    },
                  ~ {
                      ~ Action   = [
                            "iam:GetUser",
                          - "iam:GetUserPolicy",
                          - "iam:ListAccessKeys",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.longhorn_system.aws_s3_bucket.longhorn_backups will be created
  + resource "aws_s3_bucket" "longhorn_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "longhorn-backups.billv.ca"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Error: reading IAM User (longhorn): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: 786c4784-0126-4840-9589-cabcda9d414c, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user longhorn because no identity-based policy allows the iam:GetUser action
│ 
│   with module.longhorn_system.aws_iam_user.longhorn,
│   on modules/longhorn-system/main.tf line 25, in resource "aws_iam_user" "longhorn":
│   25: resource "aws_iam_user" "longhorn" {
│ 
╵


```
</details>